In [1]:
import pandas as pd
df = pd.read_csv('./input_data.csv')
df

   Fruits  Price
0   Apple  10.99
1  Orange  11.99
2  Banana  12.99
3   Lemon    NaN

In [2]:
df.dropna()

   Fruits  Price
0   Apple  10.99
1  Orange  11.99
2  Banana  12.99

In [3]:
df['Price'].mean()

11.99

In [4]:
df.fillna(df['Price'].mean())

   Fruits  Price
0   Apple  10.99
1  Orange  11.99
2  Banana  12.99
3   Lemon  11.99